자바와 가상머신

"한 번만 작성하면, 어디서든 동작한다. (Write Once, Run Anywhere.)"


자바의 특징을 잘 나타내는 문구입니다.


프로그래밍을 힘들게 하는 요소에는 무엇이 있을까요?
대표적으로 '호환성' 문제가 있습니다.


어떤 언어는 운영체제에 따라 동작이 달라집니다.
분명히 윈도우즈에서는 잘 동작했는데, 맥에서 동작하지 않는 일이 발생합니다.
그래서 우리가 개발할 때는 항상 운영체제를 신경써야 합니다.
중간 중간 테스트도 해주어야 하고요.


만약 휴대폰 애플리케이션을 개발한다면 어떨까요?
최악의 경우, 모든 휴대폰 기종을 모아서 매번 테스트를 해봐야겠네요.


자바는 이런 '호환성'문제를 해결해 줍니다.


'자바 가상머신'이라는 것만 설치되면, 어느 운영체제이든, 어느 디바이스이든, 동일하게 동작합니다.
(자바 가상머신은 영어로 Java Virtual Machine, 줄여서 JVM 이라고 부릅니다.)


이러한 자바의 높은 호환성은 애플리케이션의 특징과도 잘 맞아떨어지기 때문에, 애플리케이션 개발에 활발히 사용되고 있죠.


가상머신을 내 컴퓨터에

이와 관련된 용어를 조금 더 알아보자면,
JVM을 사용해서 마음껏 개발할 수 있는 환경을 JRE (Java Runtime Environment) 라고 부르며,
내 컴퓨터에 이런 환경을 만들기 위해서는 JDK (Java Development Kit) 라는 것을 설치하면 됩니다.


자바는 현재 오라클의 소유이기 때문에, 다음 강의에서는 오라클 사이트에 접속해서 JDK를 설치해봅시다.

